{
  "users": [
    {
      "id": 1,
      "username": "user1",
      "password": "password123",
      "email": "user1@example.com"
    }
  ],
  "newsletters": [
    {
      "id": 0,
      "name": "Breaking US Politics",
      "summary": "When it happens in US Politics, you know!",
      "category": "Politics",
      "photo": "assets/USPolitics.png",
      "frequency": "ASAP",
      "description": "A daily roundup of the most important political headlines in the U.S. with a curated list of articles, expert analyses, and breaking news links. Stay informed about the latest in policy changes, elections, and legislative developments.",
      "featured": false
    },
    {
      "id": 1,
      "name": "Daily World News",
      "summary": "A daily recap of world events.",
      "category": "News",
      "photo": "assets/WorldNews.png",
      "frequency": "Daily",
      "description": "Your global news digest, featuring a selection of top stories from around the world. Each issue includes curated links to key reports on international politics, social movements, and global events, with insightful descriptions to guide your reading.",
      "featured": false
    },
    {
      "id": 2,
      "name": "Pro Gardening",
      "summary": "Tips by and for those with a green thumb in the garden.",
      "category": "Lifestyle",
      "photo": "assets/ProGardening.png",
      "frequency": "Monthly",
      "description": "A collection of expert gardening tips and news, with a curated list of the latest articles, blog posts, and studies on plant care, landscaping, and eco-friendly gardening practices. Each link is accompanied by a brief summary to help you dig deeper into your garden projects.",
      "featured": true
    },
    {
      "id": 3,
      "name": "World Climate News",
      "summary": "Things are heating up!  We'll tell you why and what you can do.",
      "category": "News",
      "photo": "assets/WorldClimate.png",
      "frequency": "Weekly",
      "description": "Curated coverage of global climate change, sustainability efforts, and environmental policy. This newsletter includes a carefully selected list of articles and studies on climate action, conservation, and environmental news, along with summaries for quick insights.",
      "featured": false
    },
    {
      "id": 4,
      "name": "NBA News",
      "summary": "Basketball news in the NBA.",
      "category": "Sports",
      "photo": "assets/NBANews.png",
      "frequency": "Daily",
      "description": "A curated collection of the latest NBA news, game highlights, player updates, and league insights. Each edition includes links to expert analyses, team rankings, and breaking news stories with descriptions to keep you in the loop on everything basketball.",
      "featured": false
    },
    {
      "id": 5,
      "name": "MLS News",
      "summary": "Soccer news in MLS.",
      "category": "Sports",
      "photo": "assets/MLSNews.png",
      "availableUnits": 2,
      "frequency": "Daily",
      "description": "Stay updated with Major League Soccer through a curated list of articles, match reports, player transfers, and league news. Each newsletter features summaries and links to the most relevant stories for soccer fans across North America.",
      "featured": false
    },
    {
      "id": 6,
      "name": "Breaking World News",
      "summary": "Important world news alerts.",
      "category": "News",
      "photo": "assets/BreakingWorldNews.png",
      "frequency": "ASAP",
      "description": "Get the top breaking global stories, with a curated selection of the most urgent news articles and reports from trusted sources. Each issue includes a brief description of each link to help you quickly understand and follow the unfolding events.",
      "featured": false
    },
    {
      "id": 7,
      "name": "Software Development Lifestyle",
      "summary": "Keep up with the latest in the ever changing world of software development.",
      "category": "Lifestyle",
      "photo": "assets/SoftwareDevLifestyle.png",
      "frequency": "ASAP",
      "description": "A curated collection of resources for software developers, featuring links to blog posts, tutorials, and articles on coding techniques, work-life balance, and industry trends. Each link is accompanied by a description to offer you key insights and advice in your development journey.",
      "featured": true
    },
    {
      "id": 8,
      "name": "Seriously Simple Bites",
      "summary": "Only simple yummy things.",
      "category": "Lifestyle",
      "photo": "assets/Baking.png",
      "frequency": "Monthly",
      "description": "Your go-to source for easy, delicious recipes to whip up in your own kitchen. Each month, we curate a selection of simple yet mouthwatering dishes that anyone can make, no matter their cooking experience. From quick snacks to satisfying meals, these bite-sized recipes are sure to satisfy your cravings without the hassle.",
      "featured": true
    },
    {
      "id": 9,
      "name": "Driving 'Round",
      "summary": "Cars.",
      "category": "Lifestyle",
      "photo": "assets/DrivingRound.png",
      "frequency": "Monthly",
      "description": "For the car enthusiast who loves everything about the world of wheels. Every edition of Driving 'Round brings you the latest news on car culture, reviews, and updates from the automotive world. From new releases to classic models, and from racing circuits to road trips, this newsletter is your pit stop for all things car-related. Buckle up for the ride!",
      "featured": false
    }
  ]
}
